<template>
    <section class="register-container">
        <yd-navbar title="" class="fixed-header">
            <div @click="backGo" slot="left">
                <yd-navbar-back-icon></yd-navbar-back-icon>
            </div>
        </yd-navbar>


	<section class="register-bittorrent"  >
	<hr>
		<yd-flexbox >
            <yd-flexbox-item >
                <yd-button size="large"  type="hollow" style="font-weight: bold;" bgcolor="#fff" >用户注册协议</yd-button>
            </yd-flexbox-item>
        </yd-flexbox>



	     <div style=" font-size: 13px; padding: 20px;"><em>本站是指域名为“zhahehe.COM”的网站，是由北京扎呵呵科技有限公司独立开发、运营的电子商务平台。
             本站在此特别提醒用户认真阅读、理解本《用户协议》（以下简称“本协议”）各项条款，特别是其中所涉及的免除、限制本公司责任的条款、争议解决和法律适用等。本协议包括协议正文及所有本站已经发布的或将来可能发布或更新的各类规则，所有规则为本协议不可分割的组成部分，与本协议正文具有同等法律效力。请用户谨慎阅读并选择接受或不接受本协议内容及其所属各类规则（未成年不适合本用户协议）。用户在本站注册、登陆或使用本站服务，即表示用户完全接受本协议的全部条款，并同意接受其约束。
             本站有权根据实际情况和具体需要修订本协议各项条款/各类规则，并在本站相关系统板块进行公示，修订发布一经公布后立即生效，无需另行单独通知。如果您继续使用本站的服务，即表示您接收新的协议条款且愿意遵守本站的各项制度规定。如果您不同意修订后的协议内容，您应立即停止使用本站服务。</em>

	<div style="font-weight: bolder;  margin-top: 10px;">第一条 本站服务条款的确认和接纳</div>

<em><div>1.1 本站的各项电子服务的所有权和运作权归北京扎呵呵科技有限公司所有。用户通过完成注册程序并点击“我已阅读并且同意《注册协议》”的按钮，即可与本站达成协议并接受所有的服务条款。用户应当明确：无论事实上是否在注册前认真阅读，
    只要您点击“同意并继续”按钮并按照本站注册程序完成注册为本站用户，以及在注册成为本站用户之后点击进入本站，您的行为就已表示您无条件接受了本使用条款协议及北京扎呵呵科技有限公司所公布的各项管理规定，并愿意受其约束。如果发生纠纷，用户不得以未仔细阅读为由实行抗辩。</div>

    <div>1.2 用户点击同意本协议的，即视为用户确认自己具有享受本站服务、下单购物等相应的权利能力和行为能力，能够独立承担法律责任。</div>

    <div>1.3 如果用户在18周岁以下，只能在父母或监护人的监护参与下才能使用本站。</div>

    <div>1.4 用户应当具备使用本站、在本站网购买商品、享受服务的完全民事行为能力，并承若对相关行为承担相应的法律责任。</div>

    <div>1.5 本站保留在中华人民共和国大陆地区法律及本协议约定允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。</div>

<div style="font-weight: bolder;  margin-top: 10px;">第二条 本站服务</div>
<div>2.1本站通过互联网依法为用户提供售卖相关的一站式服务，用户在完全同意本协议及本站规定的情况下，方有权使用本站的相关服务。</div>
<div>2.2用户必须自行准备如下设备和承担如下开支：（1）上网设备，包括并不限于电脑、手机或者其他上网终端、调制解调器及其他必备的上网装置；（2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。</div>


<div style="font-weight: bolder;  margin-top: 10px;">第三条 会员注册相关规定</div>
<div>3.1本站进行会员注册免费制，本站不会向任何消费者会员收取会员费。</div>
    <div> 3.2用户应自行诚信向本站提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。所有原始键入的资料将引用为注册资料。如因注册资料不合法、不真实而引起的任何问题，用户需承担因此引起的相应责任及后果，本站不承担任何责任，并且本站保留终止用户使用本站各项服务的权利。</div>
    <div> 3.3用户注册时设置的账户名称不得违反国家法律法规规定，否则本站将收回用户设置的账户名称，并有权要求用户更改账户名称。如用户拒绝更改账户名称的，本站有权采取警告、冻结、关闭该账户以及拒绝提供服务、取消订单等措施。</div>
    <div> 3.4成功注册后，本站会为每位注册用户开通一个账户，作为用户使用本站服务的唯一身份标识，用于日后购买商品、使用服务、获得积分及享受各项会员权益，为保证用户正常使用，用户应当妥善保管账户名称及密码，并对其账户项下发生的所有行为负责。如因用户主动泄露或遭受他人恶意攻击诈骗等行为导致的损失及后果，由用户自行承担，本站不承担任何责任。</div>
    <div> 3.5每位用户只允许注册拥有一个本站账户。如有证据证明本站用户同时拥有多个注册账户的情形，本站有权采取警告、冻结、关闭该账户以及拒绝提供服务、取消订单等措施。对因此给本站和相关方造成损失的，用户应当承担相应的法律责任。</div>
    <div> 3.6注册成为本网站用户后，忘记账户名或使用密码的，可通过采取相关信息、密保问题、绑定的手机/邮箱账号找回。</div>
    <div> 3.7进行浏览、下单购物等活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息。为保障用户安全使用本站，请在离开电脑、手机或其他可联网电子设备时正确退出本站。</div>
    <div> 3.8注册成功后，将产生用户名和密码等账户信息，您可以根据本站规定改变您的密码。用户应谨慎合理的保存、使用其用户名和密码，不得将在本站注册获得的账号、密码转让或出借予他人使用。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本站，本站将协同公安机关一起保护注册人的利益。除本站存在过错外本站不承担任何责任。</div>
    <div> 3.9本站有权收回连续12个月未登陆使用的账户，收回账户前1个月本站将会对用户发出即将收回账户的通知，若在该1个月期间，用户仍未登陆使用的，本站将收回账户且停止提供对该账户的任何服务。</div>
    <div> 3.10经用户同意，本站拥有通过邮件、短信电话等形式，向在本站注册、购物用户、收货人发送订单信息、促销活动等告知信息的权利。</div>
    <div> 3.11经用户同意，本站有权使用用户的注册信息、用户名、密码等信息，登陆进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。</div>


    <div style="font-weight: bolder;  margin-top: 10px;">第四条  使用规则</div>
    <div>4.1、用户对本站的使用行为应当遵守中华人民共和国相关法律法规，包括但不限于《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《最高人民法院关于审理涉及计算机网络著作权纠纷案件适用法律若干问题的解释(法释[2004]1号)》、《全国人大常委会关于维护互联网安全的决定》、《互联网电子公告服务管理规定》、《互联网新闻信息服务管理规定》、《互联网著作权行政保护办法》和《信息网络传播权保护条例》等有关计算机互联网规定和知识产权的法律和法规、实施办法.</div>
    <div> 4.2、本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：</div>
    <div>（1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；</div>
    <div>（2）从中国大陆向境外传输资料信息时必须符合中国有关法规；</div>
    <div>（3）不得利用本站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</div>
    <div>（4）不得干扰本站的正常运转，不得侵入本站及国家计算机信息系统；</div>
    <div>（5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的信息资料；</div>
    <div>（6）不得传输或发表损害国家、社会公共利益和涉及国家安全的信息资料或言论；</div>
    <div>（7）不得教唆他人从事本站所禁止的行为；</div>
    <div>（8）不得利用在本站注册的账户进行牟利性经营活动；</div>
    <div>（9）不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；
        用户应不时关注并遵守本站不时公布或修改的各类合法规则规定。本站保有删除站内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。
        若用户未遵守以上规定的，本站有权作出独立判断并采取暂停或关闭用户帐号等措施。用户须对自己在网上的言论和行为承担法律责任。
    </div>

    <div style="font-weight: bolder;  margin-top: 10px;">第五条  交易</div>
    <div>5.1本站所有商品（包括本站自营商品及第三方商家销售商品）价格、数量、能否提供等商品信息随时都有可能发生变动，本站保留信息调整不及时通知用户的权利。商品价格、付款条件和配送在订单中以书面形式明确约定为准。用户下订单时，应仔细确认所购商品的名称、价格、数量、说明、注意事项、联系地址、电话、联系人等信息。</div>
    <div>5.2用户提交购买订单后本站或第三方商家将及时对订单进行查看审核且确认是否有货，本站或商家点击同意订单发出订单确认信息后，用户的订单申请才成立。用户应在规定时间内进行付款并正确填写收货地址。若用户未在规定时间完成付款的，本站及商家有权关闭并取消定单。</div>
    <div>5.3用户填写的收货联系人及地址，本站默认为用户可收到货品的联系人及地址；若收货联系人非用户本人的，本网站默认您授权该收货人为货品实际收货人，且该收货人的行为和产生的后果均由用户自行承担。用户提交订单即表示用户对其订单中所确认的订购商品、收货地址等信息的准确性负责。</div>
    <div>5.4用户一张订单中订购多件商品，如果本站或第三方商家只同意接受部分商品订单并发出部分订单确认信息的，用户的订单申请部分成立，用户可选择取消或支付部分订单款项。</div>
    <div>5.5户同意本网站在商城上显示的商品信息错误或缺货的情况下，有权取消或修改该订单。</div>
    <div>5.6因市场环境变化及各种难以控制的因素影响，商家无法承诺用户订单商品均会有货或无法及时发货，导致用户订购的商品或服务无法正常提供的，用户和商家皆有权取消订单，本网站不对因此导致的订单取消承担任何责任。</div>
    <div>5.7本站显示商品价格均包含法律规定的税金，配送费用将根据本站上公布的配送政策和用户选择的送货方式另行计收。</div>
    <div>5.8本站及第三方商家会将商品邮寄派送至用户订单信息中的指定地点。本站上所列出的送货时间为参考时间，参考时间受天气情况、库存数量、送货地点的影响，具体送货时间略有差异，请用户见谅。若用户出现以下情况导致订单延迟或无法正常派送的损失由用户自行承担：</div>
    <div>（1）用户提供的送货信息错误或不够详细的；</div>
    <div>（2）到达派送地点，无法联系收货人的；</div>
    <div>（3）不可抗力，例如自然灾害、政治变动、罢工、战争等；</div>
    <div>（4）无需送货商品，将不进行派送；</div>
    <div>（5）无法正常派送的其他情形。</div>
    <div>备注：用户可登陆本站“订单管理”中查询物流信息，若长时间未收到货品可致电本站客服。</div>
    <div>5.9本站有权制定、发布商品退换货规则，以规范商家和用户之间的商品交易行为，并对该等规则享有修改权、解释权。用户在本站提交订单即表明其接受本站的退换货规则。用户在本站购物收货后，部分商品在未经使用且不影响二次销售的情况下，享受七天内无理由退换货的政策（特殊商品另有规定的除外）。</div>
    <div>5.10用户有权在下列情况取消订单：</div>
    <div>（1）用户与商家达成协商一致的；</div>
    <div>（2）商家未经确认订单之前；</div>
    <div>（3）商家发出货品之前；</div>
    <div>（4）本站公布信息有误或发生变化的，商家联系用户更改订单的；</div>
    <div>（5）商家发生缺货或无法及时发货的；</div>
    <div>（6）用户可取消订单的其他情形。</div>
    <div>5.11商家有权在下列情况取消订单：</div>
    <div>（1）商家与用户达成协商一致的；</div>
    <div>（2）本站公布信息有误或缺货的；</div>
    <div>（3）用户订单信息错误、超出限定购买数量或超出商家货品数量的；</div>
    <div>（4）商家可取消订单的其他情形。</div>
    <div>5.12本站可取消订单的情形：</div>
    <div>（1）与用户达成协商一致的；</div>
    <div>（2）本站公布信息有误或缺货的；</div>
    <div>（3）用户订单信息错误、超出限定购买数量或超出本站货品数量的；</div>
    <div>（4）如因不可抗力、系统故障、特殊原因或遭受第三方恶意攻击等情形经本站判断需要取消订单的；</div>
    <div>（5）经本站判断，用户存在虚假或违背购物诚实、信用、公平原则情形的；</div>
    <div>（6）按本站已经发布的或将来可能发布或更新的各类规则，可取消订单的其他情形。</div>
    <div>5.13用户在成功购物后，可针对所购货品及服务发表评价，并对评价内容的真实性、客观性负责，不发布污言秽语、辱骂诽谤、广告、有损他人利益及国家法律法规明令禁止的信息，本网站有权对用户发布的信息进行监督审核，对不利的信息及时采取删除或禁止显示等措施。</div>
    <div>5.14用户在本站发布的信息是公开的，其他用户可以进行查看，用户若不愿意透露个人身份可选择匿名或针对关键信息进行马赛克等形式发布。</div>
    <div>5.15用户在本站发布的各种观点均源自于用户的个人想法或行为，不代表本网站观点，本网站不负任何法律责任。</div>
    <div>5.16用户应对在本站的所有行为负责，对恶意评价、盗用他人账户、泄露他人信息、发布非法违禁信息、骗取他人财物、不正当谋利等行为本站有权采取扣除相应积分及冻结、封锁账户等措施。</div>
    <div>5.17本站向用户个人信息中的联系信息（包括手机/邮箱/邮寄地址等方式）发出通知时，视为用户已收到并了解相关信息。</div>
    <div>5.18通过本站购买的商品，如果发现商品短缺、配送错误、破损等问题，请及时联系客服人员，直至问题处理到您满意。用户收到商品7天之内发现质量问题，可以安排退换货服务。</div>


    <div style="font-weight: bolder;  margin-top: 10px;">第六条  知识产权声明</div>
    <div>6.1本站服务显示的所有内容包括诸如文字、图片、标识、文章、图像、声音、商标、数据文件等信息均属北京扎呵呵科技有限公司及其关联公司、第三方合作商家及内容提供者的财产，受中国和国际版权法保护，任何个人或组织未经书面授权不得以任何目的对本网站内容进行复制、修改、改编或以其他方式加以利用。</div>
    <div>6.2北京扎呵呵科技有限公司是本站的制作者,拥有本站内容及资源的著作权等合法权利,受国家法律保护,有权不时地对本协议及本站的内容进行修改，并在本站张贴，无须另行通知用户。在法律允许的最大限度范围内，北京微波网超科技有限公司对本协议及本站内容拥有解释权。</div>
    <div>6.3用户可内容进行分享、转发至社交平台或其他网站，前提必须是非商业、非盈利、非广告性目的的行为且注明作者及文章图片内容来源出处为本站；用户用于商业、盈利、广告性目的的需征得本站、商家或原作者的同意，并注明作者及文章图片内容来源于本站。</div>
    <div>6.4户对本站进行修改、复制、变更后发布的需征得本站、商家或原作者的同意，并注明授权内容和范围；</div>
    <div>6.5本站发布的文章及图片（包含收集整理转载的文章及图片）版权归原作者所有，若作者有版权声明或从其他网站转载而附带有原版权声明的，以版权归属附带声明为准。</div>
    <div>6.6未书面授权恶意使用本站内容的，本站保留将其诉诸法律的权利。</div>

    <div style="font-weight: bolder;  margin-top: 10px;">第七条  责任说明</div>
    <div>7.1本站有义务在技术上确保网站的正常运行，尽力避免服务中断或将中断时间限制在最短时间内，保证会员网上交易活动的顺利进行。但以下情况，本站无需承担任何责任：</div>
    <div>（1）用户将会员密码告知他人或与他人共享注册账户，由此导致任何个人资料泄露。</div>
    <div>（2）任何由于黑客攻击、计算机病毒侵入或发作、因政府管理而造成暂时性关闭等影响网络正常经营之不可抗力而造成本网站崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等；</div>
    <div>（3）任何会员向本站提供错误、不完整、虚假信息等造成不能正常使用本站服务或遭受任何其他损失，概与本站无关。</div>
    <div>（4）由于长时间未使用，或者本站认为用户已经违反本服务协议的文字及精神，终止用户的密码、账号或本服务的使用，并可以将用户的任何内容移除并删除，由此对用户或第三方的任何损失，与本站无关。</div>
    <div>7.2用户在符合国家法律法规及本协议规定正确使用本站商品或服务的，由于本站或第三方合作商家对用户造成损失的，本站或第三方商家将承担全部责任但不超过用户购买该产品所获得的直接利益。由本站先行支付款项的，将从第三方商家保证金或款项结算中予以扣除，不足以弥补本站损失的部分，本站有权追究第三方商家的赔偿及相关法律责任。该责任将在法律保护内最大限度保护消费者的合法权益，且在用户账户注销后仍有效保护。</div>
    <div> 7.3本网站目前页面展示的内容，按“现有”和“现状”基础上提供产品信息和相关说明。除另有明确书面说明的情况外，本网站不对网站上的信息、内容、材料、产品或服务作任何形式的明示或暗示的担保。用户同意承担使用本站所产生的风险并对所购商品做出合理正确的判断。</div>

    <div style="font-weight: bolder;  margin-top: 10px;">第八条 协议更新及终止</div>
    <div>8.1根据国家法律法规变化及网站运营需要，本站有权对本协议条款不时地进行修改，修改后的协议一旦被张贴在本站上即生效，并代替原来的协议。用户可随时登陆查阅最新协议；用户有义务不时关注并阅读最新版的协议及本站公告。如用户不同意更新后的协议，可以且应立即停止接受本站站依据本协议提供的服务；如用户继续使用本站提供的服务的，即视为同意更新后的协议。本站建议您在使用本站之前阅读本协议及本站的公告。如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。</div>
    <div>8.2用户提出协议终止的情形：</div>
    <div>（1）用户不愿意继续使用本网站，且满足本网站中注销账户条件的；</div>
    <div>（2）用户在注册后连续十二个月未登陆使用账户的；</div>
    <div>（3）协议或条款修订后，用户不接受新的协议或条款的。</div>
    <div>8.3本站终止用户协议的情形：</div>
    <div>（1）用户违反国家法律法规及本协议中约定的条款的；</div>
    <div>（2）用户使用虚假信息注册本站账户经查明取证的；</div>
    <div>（3）用户注册填写信息有误，且本站运用用户在本站注册的各种信息均无法联系用户本人的；</div>
    <div>（4）用户恶意评价、盗用他人账户、泄露他人信息、发布非法违禁信息、骗取他人财物、不正当谋利、侵犯他人合法权益等行为的；</div>
    <div>（5）其他终止服务的情形。</div>
    <div>备注：上述终止用户协议情形发生时，用户对本站用户、商家及本站造成损失的，本网站将追究法律责任。用户账户注销后，本网站有权保存账户信息基本资料，对日后发生法律纠纷及问题的，本网站仍保留对该用户追究法律责任的权利。在上述情形中任何一方终止用户协议时，因终止协议给用户造成的任何问题或损害后果均由用户自行承担，本网站概不负责。</div>

    <div style="font-weight: bolder;  margin-top: 10px;">第九条 法律管辖和适用</div>
    <div>9.1本协议的订立、变更、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规法则）。如与本协议有关的某一特定事项缺乏明确法律规定，则应参照通用的国际商业惯例和行业惯例。</div>
    <div>9.2如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。 如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向北京扎呵呵科技有限公司所在地有管辖权的中华人民共和国大陆地区法院提起诉讼。</div>

    <div style="font-weight: bolder;  margin-top: 10px;">第十条 其他</div>
    <div>10.1本站所有者是指在政府部门依法许可或备案的本站自主经营主体。</div>
    <div>10.2本站尊重用户和消费者的合法权利，本协议及本站上发布的各类规则、声明等其他内容，均是为了更好的、更加便利的为用户和消费者提供服务。本站欢迎用户和社会各界提出意见和建议，本站将虚心接受并适时修改本协议及本站上的各类规则。</div>
    <div>10.3如本协议中的任何条款无论因何种原因完成、部分无效或不具备有执行力，本协议的其余条款仍应有效并且具有约束力。</div>
    <div>10.4本协议内容中以黑体、加粗、下划线、斜体等方式显著标识的条款，请用户着重阅读。</div>
    <div>10.5本协议的解释权归本站所有。如果其中有任何条款与国家的有关法律相抵触，则以国家法律的明文规定为准。</div>
    <div>10.6您在注册页面选择“我已阅读并且同意《注册协议》”即视为您完全接受本协议，在操作之前请您再次确认已知悉并完全理解本协议的全部内容。</div>


</em>

</div>

        <hr/>


        </section>

     </section>

</template>


<script>
    import Qs from 'qs'
export default {
    name: 'writer',
    data() {
        return {

        }
    },
    methods: {
        backGo() { window.history.length > 1
            ? this.$router.go(-1)
            : this.$router.push('/') },
      }
}

</script>
<style>

.register-bittorrent {
    position: relative;
    margin-top: 1rem;
    background-color: #fff;
}



.corner-mark {
    position: absolute;
    top: 0;
    right: -.06rem;
    width: .4rem;
    height: .4rem;
    color: #fff;
    font-size: 13px;
    text-align: center;
    border-radius: 50%;
    line-height: .4rem;
    background-color: #DAB461;
}

.register-parameter-content {
    padding-left: 0;
}
.register-parameter-content div[class^="yd-flexbox"] {
    min-height: .5rem;
    min-width: .1rem;
    text-align: left;
    padding-left: .5rem;
    justify-content: flex-start;
    font-size: 14px;
}


.register-parameter-content .yd-flexbox-left {
    color: #000;

}
.register-parameter-content .yd-flexbox-left .label {
    position: relative;
}
.register-parameter-content .yd-flexbox-left .label:after {
    position: absolute;
    top: 0;
    right: -.6em;
}

.register-parameter-content:after {
    border-bottom: .1rem dotted #d9d9d9 !important;
}



.register-seckill-txt {
    width: 100%;
    color: #525252;
    font-size: .3rem;
    padding: .12rem .24rem;
    overflow: hidden;
}




</style>