<?php
// +----------------------------------------------------------------------
// | 银行账号定义
// +----------------------------------------------------------------------
// | Copyright (c) 2018 http://zhahehe.com All rights reserved.
// +----------------------------------------------------------------------
// | 版权所有：昌少 
// +----------------------------------------------------------------------
// | Author: 昌少  Date:2018/9/4 Time:21:19
// +----------------------------------------------------------------------

/**
 * 开户行银行账号
 */
if (!defined('BANK_ACCOUNT')) {
    define('BANK_ACCOUNT', '110932626410801');
}
/**
 * 开户行银行名称
 */
if (!defined('BANK_NAME')) {
    define('BANK_NAME', '招商银行');
}
/**
 * 开户行银行支行名称
 */
if (!defined('BANK_BRANCH_NAME')) {
    define('BANK_BRANCH_NAME', '招商银行股份有限公司北京东直门支行');
}
/**
 * 开户行银行账号开户名称
 */
if (!defined('BANK_ACCOUNT_NAME')) {
    define('BANK_ACCOUNT_NAME', '北京扎呵呵科技有限公司');
}
