<?php
// +----------------------------------------------------------------------
// | 定义免token验证接口
// +----------------------------------------------------------------------
// | Copyright (c) 2018 http://qudiandang.com All rights reserved.
// +----------------------------------------------------------------------
// | 版权所有：昌少 
// +----------------------------------------------------------------------
// | Author: 昌少  Date:2018/10/15 Time:18:19
// +----------------------------------------------------------------------
namespace Services\Auth;
return [
    'v1/User/login', //登录
    'v1/user/fastLogin', //快捷登录
    'v1/User/register', //注册
    'v1/common/sendSms', //短信验证码
    'v1/common/commonSms', //短信验证码
    'v1/User/imgCode', // 图片验证码
];