<?php
// +----------------------------------------------------------------------
// | PhpStorm
// +----------------------------------------------------------------------
// | Copyright (c) 2018 http://zhahehe.com All rights reserved.
// +----------------------------------------------------------------------
// | 版权所有：昌少 
// +----------------------------------------------------------------------
// | Author: 昌少  Date:2018/8/23 Time:20:55
// +----------------------------------------------------------------------


namespace Validate;


class Image
{
    /**
     * 定义数据验证规则
     * @var array
     */
    static $rule = [
        'img_url' => 'require'
    ];
    /**
     * 定义数据验证错误提示
     * @var array
     */
    static $message = [
        'img_url.require' => '汇款图片必填,多张图片以‘,’分隔',
    ];
    /**
     * 定义数据验证场景
     * @var array
     */
    static $scene = [
        'add' => ['img_url']
    ];
}