<?php
// +----------------------------------------------------------------------
// | PhpStorm
// +----------------------------------------------------------------------
// | Copyright (c) 2018 http://zhahehe.com All rights reserved.
// +----------------------------------------------------------------------
// | 版权所有：昌少 
// +----------------------------------------------------------------------
// | Author: 昌少  Date:2018/8/17 Time:16:08
// +----------------------------------------------------------------------


namespace Validate;


class Purchase
{
    /**
     * 定义数据验证规则
     * @var array
     */
    static $rule = [
        'title' => 'require',
        'name' => 'require',
        'mobile' => 'require',
    ];
    /**
     * 定义数据验证错误提示
     * @var array
     */
    static $message = [
        'title.require' => '采购名称必填',
        'name.require' => '姓名必填',
        'mobile.require' => '手机号必填',
    ];
    /**
     * 定义数据验证场景
     * @var array
     */
    static $scene = [
        'add' => ['name'],
        'edit' => ['name'],
    ];
}