<?php
// +----------------------------------------------------------------------
// | 回收设置表
// +----------------------------------------------------------------------
// | Copyright (c) 2018 http://zhahehe.com All rights reserved.
// +----------------------------------------------------------------------
// | 版权所有：黄献国 
// +----------------------------------------------------------------------
// | Author: 黄献国   Date:2018/11/6 Time:10:00
// +----------------------------------------------------------------------
namespace Recovery;

use Assemble\Builder;
use Assemble\Support\Arr;
use Supplier\SupplierModel;

class RecoverySetModel extends \BaseModel
{
  

}