<?php
// +----------------------------------------------------------------------
// | 采购类库存操作
// +----------------------------------------------------------------------
// | Copyright (c) 2018 http://zhahehe.com All rights reserved.
// +----------------------------------------------------------------------
// | 版权所有：昌少 
// +----------------------------------------------------------------------
// | Author: 昌少  Date:2018/8/29 Time:20:23
// +----------------------------------------------------------------------


namespace Services\Stock;

class OrderStockService extends StockService
{
    public function __construct(array $product)
    {
        parent::__construct($product);
    }
}